# Dataframes en Pandas

## Lectura, escritura / Mezcla y muestra

Importamos la librería pandas:

In [10]:
import pandas as pd

Aquí vemos como se lee el csv y posteriormente se muestran los dos primeros:

In [11]:
df_penguins = pd.read_csv('penguins.csv')
df_penguins.head(2)

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007

De esta forma escribimos el dataframe en un archivo csv:

In [12]:
df_penguins.to_csv('penguins.csv', index=False)

De esta forma hacemos una copia del dataframe, pero desordenada:

In [13]:
# frac -> Indica el porcentaje del dataframe que quieres obtener.
df_shuffled = df_penguins.sample(frac=1)
df_shuffled.head(2)

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
125,126,Adelie,Torgersen,40.6,19.0,199.0,4000.0,male,2009
123,124,Adelie,Torgersen,41.4,18.5,202.0,3875.0,male,2009

De esta forma, nos quedamos con la mitad del dataframe:

In [14]:
df_sampled = df_penguins.sample(frac=0.5)
print(f'Longitud del dataframe original: {len(df_penguins)}, longitud del dataframe muestreado: {len(df_sampled)}')

Longitud del dataframe original: 344, longitud del dataframe muestreado: 172

## Añadiendo nuevas columnas

Vamos a crear manualmente un dataframe y mostrarlo:

In [15]:
df = pd.DataFrame({'temp_celsius': [35.0, 25.0]}, index=['Delhi', 'Mumbai'])
df

        temp_celsius
Delhi           35.0
Mumbai          25.0

Ahora, podemos insertar una nueva columna de la siguiente forma:

In [16]:
speed_values = [26.0, 30.0]
df = df.assign(wind_speed_kmh=speed_values)
df

        temp_celsius  wind_speed_kmh
Delhi           35.0            26.0
Mumbai          25.0            30.0

Podemos usar lambdas para generar columnas nuevas usando columnas ya existentes:

In [17]:
df = df.assign(wind_speed_mph = lambda x: x['wind_speed_kmh'] * 0.621)
df

        temp_celsius  wind_speed_kmh  wind_speed_mph
Delhi           35.0            26.0          16.146
Mumbai          25.0            30.0          18.630

In [18]:
df.assign(temp_fahrenheit = lambda x: x['temp_celsius'] * 9/5 + 32,
            temp_kelvin = lambda x: (x['temp_fahrenheit'] + 459.67) * 5/9)

,temp_celsius,wind_speed_kmh,wind_speed_mph,temp_fahrenheit,temp_kelvin
Delhi,35.0,26.0,16.146,95.0,308.15
Mumbai,25.0,30.0,18.630,77.0,298.15

## Genera estadísticas descriptivas de tus dataframes

In [20]:
stocks = pd.read_csv('stocks.csv')
stocks.head(2)

  symbol    open    high     low   close    volume
0    AAL   49.00   49.10   48.47   48.63  11901883
1   AAPL  145.13  147.16  145.11  146.28  33917635

In [21]:
stocks.describe()

             open         high         low        close        volume
count     8.00000     8.000000    8.000000     8.000000  8.000000e+00
mean    340.77875   344.858750  339.768750   344.450000  1.154062e+07
std     410.48659   412.905981  409.354966   412.720701  1.242752e+07
min      20.22000    20.750000   20.110000    20.680000  1.356386e+06
25%      64.81750    65.712500   64.557500    65.565000  2.505832e+06
50%     144.44000   146.375000  144.085000   145.845000  6.993746e+06
75%     483.87500   496.990000  482.865000   496.692500  1.562738e+07
max    1002.54000  1004.620000  998.020000  1003.740000  3.391764e+07

In [61]:
perc = [.50, .90]
subsets = pd.IndexSlice[['90%'], 'open']
stocks.describe(percentiles=perc).style.map(lambda x: "background-color: magenta", subset=subsets)

# Aplicar funciones a los DataFrames

In [62]:
import numpy as np

df = pd.DataFrame({'A': [1, 2], 'B': [4, 5]})
df

   A  B
0  1  4
1  2  5

In [63]:
df.apply(func = np.sum, axis=0)

A    3
B    9
dtype: int64

In [64]:
df.apply(func = np.sum, axis=1)

0    5
1    7
dtype: int64

In [65]:
A_plus_B = df.apply(func = lambda row: row['A'] + row['B'], axis=1)
df['A_plus_B'] = A_plus_B
df

   A  B  A_plus_B
0  1  4         5
1  2  5         7

In [66]:
df.apply(func = lambda col: (col[0] + col[1]) / 2, axis=0)

A           1.5
B           4.5
A_plus_B    6.0
dtype: float64

# Agrupar datos por ciertos criterios

In [68]:
df = pd.read_csv('weather_data.csv')
df.head(2)

    outlook temperature humidity  windy play
0  overcast         hot     high  False  yes
1  overcast        cool   normal   True  yes

In [75]:
for outlook, outlook_df in df.groupby('outlook'):
  print(outlook)
  print(outlook_df)
  print('-' * 50)

overcast
    outlook temperature humidity  windy play
0  overcast         hot     high  False  yes
1  overcast        cool   normal   True  yes
2  overcast        mild     high   True  yes
3  overcast         hot   normal  False  yes
--------------------------------------------------
rainy
  outlook temperature humidity  windy play
4   rainy        mild     high  False  yes
5   rainy        cool   normal  False  yes
6   rainy        cool   normal   True   no
7   rainy        mild   normal  False  yes
8   rainy        mild     high   True   no
--------------------------------------------------
sunny
   outlook temperature humidity  windy play
9    sunny         hot     high  False   no
10   sunny         hot     high   True   no
11   sunny        mild     high  False   no
12   sunny        cool   normal  False  yes
13   sunny        mild   normal   True  yes
--------------------------------------------------

In [76]:
df.groupby('outlook').max()

         temperature humidity  windy play
outlook
overcast        mild   normal   True  yes
rainy           mild   normal   True  yes
sunny           mild   normal   True  yes

In [77]:
df.groupby('outlook').describe()

         temperature                   humidity                     windy  \
               count unique   top freq    count unique     top freq count
outlook
overcast           4      3   hot    2        4      2    high    2     4
rainy              5      2  mild    3        5      2  normal    3     5
sunny              5      3   hot    2        5      2    high    3     5

                             play
         unique    top freq count unique  top freq
outlook
overcast      2  False    2     4      1  yes    4
rainy         2  False    3     5      2  yes    3
sunny         2  False    3     5      2   no    3

# Iterando sobre un DataFrame

In [ ]:
df_penguins = pd.read_csv("penguins.csv")
index_series_pairs = [pair for pair in df_penguins.iterrows()]
idx, series = index_series_pairs[0]
print(idx)
print('-' * 50)
print(series)
print('-' * 50)

0
--------------------------------------------------
rowid                        1
species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       male
year                      2007
Name: 0, dtype: object
--------------------------------------------------

In [82]:
named_tuples = [tup for tup in df_penguins.itertuples()]
print(named_tuples[0])

Pandas(Index=0, rowid=1, species='Adelie', island='Torgersen', bill_length_mm=39.1, bill_depth_mm=18.7, flipper_length_mm=181.0, body_mass_g=3750.0, sex='male', year=2007)

# Busqueda por valor o posición

In [83]:
df = pd.read_csv("penguins.csv")
df.head(4)

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007

In [84]:
df.loc[2]

rowid                        3
species                 Adelie
island               Torgersen
bill_length_mm            40.3
bill_depth_mm             18.0
flipper_length_mm        195.0
body_mass_g             3250.0
sex                     female
year                      2007
Name: 2, dtype: object

In [85]:
df.loc[0:3:2]

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007

In [86]:
df.loc[1:2, ['species', 'sex']]

  species     sex
1  Adelie  female
2  Adelie  female

In [92]:
df.loc[(df['bill_length_mm'] > 50.5) & (df['sex'] == 'female')]

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
293,294,Chinstrap,Dream,58.0,17.8,181.0,3700.0,female,2007
320,321,Chinstrap,Dream,50.9,17.9,196.0,3675.0,female,2009

# Ordenar los DataFrames

In [93]:
df = pd.read_csv("penguins.csv")
df.head()

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,5,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [94]:
df.sort_values(by=['species'])

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
97,98,Adelie,Dream,40.3,18.5,196.0,4350.0,male,2008
98,99,Adelie,Dream,33.1,16.1,178.0,2900.0,female,2008
99,100,Adelie,Dream,43.2,18.5,192.0,4100.0,male,2008
100,101,Adelie,Biscoe,35.0,17.9,192.0,3725.0,female,2009
...,...,...,...,...,...,...,...,...,...
253,254,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,male,2009
252,253,Gentoo,Biscoe,48.5,15.0,219.0,4850.0,female,2009
251,252,Gentoo,Biscoe,51.1,16.5,225.0,5250.0,male,2009
264,265,Gentoo,Biscoe,43.5,15.2,213.0,4650.0,female,2009
171,172,Gentoo,Biscoe,48.7,15.1,222.0,5350.0,male,2007

In [95]:
df.sort_values(by=['species', 'bill_length_mm'])

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
142,143,Adelie,Dream,32.1,15.5,188.0,3050.0,female,2009
98,99,Adelie,Dream,33.1,16.1,178.0,2900.0,female,2008
70,71,Adelie,Torgersen,33.5,19.0,190.0,3600.0,female,2008
92,93,Adelie,Dream,34.0,17.1,185.0,3400.0,female,2008
8,9,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007
...,...,...,...,...,...,...,...,...,...
215,216,Gentoo,Biscoe,54.3,15.7,231.0,5650.0,male,2008
267,268,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,male,2009
253,254,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,male,2009
185,186,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,male,2007
271,272,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009

In [99]:
df.sort_values(by=['bill_length_mm', 'bill_depth_mm'],
               key=lambda x: df['bill_length_mm'] + df['bill_depth_mm'])

,rowid,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
142,143,Adelie,Dream,32.1,15.5,188.0,3050.0,female,2009
98,99,Adelie,Dream,33.1,16.1,178.0,2900.0,female,2008
92,93,Adelie,Dream,34.0,17.1,185.0,3400.0,female,2008
124,125,Adelie,Torgersen,35.2,15.9,186.0,3050.0,female,2009
66,67,Adelie,Biscoe,35.5,16.2,195.0,3350.0,female,2008
...,...,...,...,...,...,...,...,...,...
339,340,Chinstrap,Dream,55.8,19.8,207.0,4000.0,male,2009
293,294,Chinstrap,Dream,58.0,17.8,181.0,3700.0,female,2007
185,186,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,male,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
271,272,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009